"use strict"

let horoscopes = {
    today: {
        Овен: "Гороскоп Овна на сегодня...",
        Телец: "Гороскоп Тельца на сегодня...",
        Близнецы: "Гороскоп Близнецов на сегодня...",
        Рак: "Гороскоп Рака на сегодня...",
        Лев: "Гороскоп Льва на сегодня...",
        Дева: "Гороскоп Девы на сегодня...",
        Весы: "Гороскоп Весов на сегодня...",
        Скорпион: "Гороскоп Скорпиона на сегодня...",
        Стрелец: "Гороскоп Стрельца на сегодня...",
        Козерог: "Гороскоп Козерога на сегодня...",
        Водолей: "Гороскоп Водолея на сегодня...",
        Рыбы: "Гороскоп Рыб на сегодня..."
    },
    tomorrow: {
        Овен: "Гороскоп Овна на завтра...",
        Телец: "Гороскоп Тельца на завтра...",
        Близнецы: "Гороскоп Близнецов на завтра...",
        Рак: "Гороскоп Рака на завтра...",
        Лев: "Гороскоп Льва на завтра...",
        Дева: "Гороскоп Девы на завтра...",
        Весы: "Гороскоп Весов на завтра...",
        Скорпион: "Гороскоп Скорпиона на завтра...",
        Стрелец: "Гороскоп Стрельца на завтра...",
        Козерог: "Гороскоп Козерога на завтра...",
        Водолей: "Гороскоп Водолея на завтра...",
        Рыбы: "Гороскоп Рыб на завтра..."
    },
    afterTomorrow: {
        Овен: "Гороскоп Овна на послезавтра...",
        Телец: "Гороскоп Тельца на послезавтра...",
        Близнецы: "Гороскоп Близнецов на послезавтра...",
        Рак: "Гороскоп Рака на послезавтра...",
        Лев: "Гороскоп Льва на послезавтра...",
        Дева: "Гороскоп Девы на послезавтра...",
        Весы: "Гороскоп Весов на послезавтра...",
        Скорпион: "Гороскоп Скорпиона на послезавтра...",
        Стрелец: "Гороскоп Стрельца на послезавтра...",
        Козерог: "Гороскоп Козерога на послезавтра...",
        Водолей: "Гороскоп Водолея на послезавтра...",
        Рыбы: "Гороскоп Рыб на послезавтра..."
    }
};
let birth = document.getElementById('birth');
let choose = document.getElementById('days');
let button = document.querySelector('button');
let text = document.querySelector('h2');

button.addEventListener('click', () => {
    let day;
    let zodiac;
    for (let option of choose) {
        if(option.selected) {
            day = option.value
        }
    }
    let birthdate = birth.value;
    if(birthdate) {
        zodiac = getSign(new Date(birthdate))
    }
    let sign = horoscopes[day][zodiac];
    text.textContent = sign;
});
function getSign(birth) {
    let day = birth.getDate();
    let month = birth.getMonth() + 1;
     if ((day >= 21  && month == 3 ) || (day <=19  && month == 4)) {
         return "Овен";
     } else if ((day >= 20  && month == 4) || (day <= 20  && month == 5)) {
         return "Телец";
     } else if ((day >= 21  && month == 5) || (day <= 21  && month == 6)) {
         return "Близнецы";
     } else if ((day >= 22  && month == 6) || (day <= 22  && month == 7)) {
         return "Рак";
     } else if ((day >= 23  && month == 7) || (day <= 22  && month == 8)) {
         return "Лев";
     } else if ((day >= 23  && month == 8) || (day <= 22  && month == 9)) {
         return "Дева";
     } else if ((day >= 23  && month == 9) || (day <= 23  && month == 10)) {
         return "Весы";
     } else if ((day >= 24  && month == 10) || (day <= 21  && month == 11)) {
         return "Скорпион";
     } else if ((day >= 22  && month == 11) || (day <= 21  && month == 12)) {
         return "Стрелец";
     } else if ((day >= 22  && month == 12) || (day <= 20  && month == 1)) {
         return "Козерог";
     } else if ((day >= 21  && month == 1) || (day <=20  && month == 2)) {
         return "Водолей";
     } else {
         return "Рыбы";
     }
 }